{"config": {"name": "model_5", "input_layers": [["Input_main", 0, 0]], "output_layers": [["output", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "Input_main", "batch_input_shape": [null, 100, 100, 3]}, "name": "Input_main", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv1", "padding": "valid", "kernel_size": [3, 3]}, "name": "conv1", "inbound_nodes": [[["Input_main", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "pool", "strides": [2, 2]}, "name": "pool", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "drop1", "trainable": true, "noise_shape": null, "rate": 0.13749544245386258}, "name": "drop1", "inbound_nodes": [[["pool", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2", "padding": "valid", "kernel_size": [3, 3]}, "name": "conv2", "inbound_nodes": [[["drop1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "pool2", "strides": [2, 2]}, "name": "pool2", "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "drop2", "trainable": true, "noise_shape": null, "rate": 0.587606728324542}, "name": "drop2", "inbound_nodes": [[["pool2", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv3", "padding": "valid", "kernel_size": [3, 3]}, "name": "conv3", "inbound_nodes": [[["drop2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "pool3", "strides": [2, 2]}, "name": "pool3", "inbound_nodes": [[["conv3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "drop5", "trainable": true, "noise_shape": null, "rate": 0.3746350041674067}, "name": "drop5", "inbound_nodes": [[["pool3", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"name": "Flat", "trainable": true}, "name": "Flat", "inbound_nodes": [[["drop5", 0, 0, {}]]], "class_name": "Flatten"}, {"config": {"units": 512, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dens1", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "name": "dens1", "inbound_nodes": [[["Flat", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"seed": null, "name": "drop3", "trainable": true, "noise_shape": null, "rate": 0.5838315653286106}, "name": "drop3", "inbound_nodes": [[["dens1", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"units": 512, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dens2", "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "name": "dens2", "inbound_nodes": [[["drop3", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"seed": null, "name": "drop4", "trainable": true, "noise_shape": null, "rate": 0.8713141896816126}, "name": "drop4", "inbound_nodes": [[["dens2", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"units": 7, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "output", "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "name": "output", "inbound_nodes": [[["drop4", 0, 0, {}]]], "class_name": "Dense"}]}, "keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Model"}