{"keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"name": "Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 1], "dtype": "float32", "sparse": false, "name": "Input"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 30, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "name": "conv1", "activity_regularizer": null}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "pool", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "drop1", "class_name": "Dropout", "config": {"name": "drop1", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["pool", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 30, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "name": "conv2", "activity_regularizer": null}, "inbound_nodes": [[["drop1", 0, 0, {}]]]}, {"name": "pool2", "class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "pool2", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "drop2", "class_name": "Dropout", "config": {"name": "drop2", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"name": "Flat", "class_name": "Flatten", "config": {"name": "Flat", "trainable": true}, "inbound_nodes": [[["drop2", 0, 0, {}]]]}, {"name": "dens1", "class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dens1", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 256, "activity_regularizer": null}, "inbound_nodes": [[["Flat", 0, 0, {}]]]}, {"name": "drop3", "class_name": "Dropout", "config": {"name": "drop3", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["dens1", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"kernel_constraint": null, "activation": "softmax", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "output", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "units": 3087, "activity_regularizer": null}, "inbound_nodes": [[["drop3", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}}