{"keras_version": "2.1.4", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 100, 100, 1], "dtype": "float32", "name": "Input"}}, {"name": "conv1", "inbound_nodes": [[["Input", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "filters": 32, "name": "conv1", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"name": "pool", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "name": "pool", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"name": "drop1", "inbound_nodes": [[["pool", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "name": "drop1", "trainable": true, "noise_shape": null, "rate": 0.2}}, {"name": "conv2", "inbound_nodes": [[["drop1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "filters": 64, "name": "conv2", "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"name": "pool2", "inbound_nodes": [[["conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "name": "pool2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"name": "drop2", "inbound_nodes": [[["pool2", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "name": "drop2", "trainable": true, "noise_shape": null, "rate": 0.2}}, {"name": "Flat", "inbound_nodes": [[["drop2", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "Flat", "trainable": true}}, {"name": "dens1", "inbound_nodes": [[["Flat", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "activation": "relu", "name": "dens1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 256}}, {"name": "drop3", "inbound_nodes": [[["dens1", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "name": "drop3", "trainable": true, "noise_shape": null, "rate": 0.2}}, {"name": "dens2", "inbound_nodes": [[["drop3", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "activation": "relu", "name": "dens2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 256}}, {"name": "drop4", "inbound_nodes": [[["dens2", 0, 0, {}]]], "class_name": "Dropout", "config": {"seed": null, "name": "drop4", "trainable": true, "noise_shape": null, "rate": 0.2}}, {"name": "output", "inbound_nodes": [[["drop4", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "activation": "softmax", "name": "output", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 7}}], "output_layers": [["output", 0, 0]], "input_layers": [["Input", 0, 0]]}}