{"backend": "tensorflow", "config": {"layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 100, 100, 3], "name": "Input_main"}, "name": "Input_main", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "name": "conv1", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid"}, "name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["Input_main", 0, 0, {}]]]}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "pool1"}, "name": "pool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"config": {"name": "drop1", "trainable": true, "seed": null, "rate": 0.5235730187653925, "noise_shape": null}, "name": "drop1", "class_name": "Dropout", "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"config": {"name": "Flat", "trainable": true}, "name": "Flat", "class_name": "Flatten", "inbound_nodes": [[["drop1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "dens1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 64, "activation": "sigmoid"}, "name": "dens1", "class_name": "Dense", "inbound_nodes": [[["Flat", 0, 0, {}]]]}, {"config": {"name": "drop_last", "trainable": true, "seed": null, "rate": 0.11245974166556161, "noise_shape": null}, "name": "drop_last", "class_name": "Dropout", "inbound_nodes": [[["dens1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "name": "output", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 8, "activation": "softmax"}, "name": "output", "class_name": "Dense", "inbound_nodes": [[["drop_last", 0, 0, {}]]]}], "output_layers": [["output", 0, 0]], "name": "model_1", "input_layers": [["Input_main", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.4"}