{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 100, 3], "sparse": false, "name": "Input_main", "dtype": "float32"}, "name": "Input_main", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2d_40", "activity_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [8, 8], "use_bias": true, "filters": 16, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "trainable": true, "bias_regularizer": null}, "name": "conv2d_40", "inbound_nodes": [[["Input_main", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_40", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "same"}, "name": "max_pooling2d_40", "inbound_nodes": [[["conv2d_40", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_40", "trainable": true, "rate": 0.3, "noise_shape": null}, "name": "dropout_40", "inbound_nodes": [[["max_pooling2d_40", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_40", "data_format": "channels_last", "trainable": true}, "name": "flatten_40", "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dens1", "activity_regularizer": null, "units": 32, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true}, "name": "dens1", "inbound_nodes": [[["flatten_40", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"seed": null, "name": "drop_last", "trainable": true, "rate": 0.3, "noise_shape": null}, "name": "drop_last", "inbound_nodes": [[["dens1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "activity_regularizer": null, "units": 6, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true}, "name": "output", "inbound_nodes": [[["drop_last", 0, 0, {}]]]}], "name": "model_40", "input_layers": [["Input_main", 0, 0]], "output_layers": [["output", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4"}